ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ЖурналСостоянийДокументов/ЖБИ_ЖурналСостоянийДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ЖурналСостоянийДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <comment>Состояние</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ЖурналСостоянийДокументов/ManagerModule.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 			= РегистрыСведений.ЖБИ_ЖурналСостоянийДокументов.СоздатьНаборЗаписей();	
	ТаблицаНабораЗаписей 	= НаборЗаписей.ВыгрузитьКолонки();
		
	Возврат ТаблицаНабораЗаписей;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей, СписокСвойствОбновления = Неопределено, СтруктураПоиска = Неопределено, СообщениеОбОшибке) Экспорт
	
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		
		НаборЗаписей = РегистрыСведений.ЖБИ_ЖурналСостоянийДокументов.СоздатьНаборЗаписей();
		
		Отбор = НаборЗаписей.Отбор;
		Период = ?(ЗначениеЗаполнено(СтрокаНабораЗаписей.Период), СтрокаНабораЗаписей.Период, ТекущаяДата()); 
		Отбор.Период.Установить(Период);
		Отбор.Объект.Установить(СтрокаНабораЗаписей.Объект);
		Если СтруктураПоиска<>Неопределено Тогда
			Для Каждого Ном Из СтруктураПоиска Цикл 
				Отбор[Ном.Ключ].Установить(Ном.Значение);	
			КонецЦикла;
		КонецЕсли;		
		НаборЗаписей.Прочитать();	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл				
				Если СписокСвойствОбновления = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей);
				Иначе
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей, СписокСвойствОбновления);
				КонецЕсли;		
			КонецЦикла;		
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;;
		Иначе 
			МенеджерЗаписи = РегистрыСведений.ЖБИ_ЖурналСостоянийДокументов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаНабораЗаписей);			
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

Функция ЗаполнитьЖурналСостоянийОбъектов(ОбъектСсылка,Состояние) Экспорт
	
	// запишем статус
	СообщениеОбОшибке = "";
	ТаблицаНабораЗаписей 	= ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр 				= ТаблицаНабораЗаписей.Добавить();	
	НоваяСтр.Период			= ТекущаяДатаСеанса();
	НоваяСтр.Объект 		= ОбъектСсылка;
	НоваяСтр.Состояние      = Строка(Состояние);
	НоваяСтр.Автор 			= Пользователи.ТекущийПользователь();
	
	Результат 				= СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибке);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
